

#include <iostream>
#include <clocale>
int main()
{
    // Task 1 - "Hello!"

    std::cout << "Task 1 - Hello!\n";
    std::cout << "\n";
    std::cout << "HELLO!!!\n";

    // Task 2 - "SQUARE"

    std::cout << "\n";
    std::cout << "Task 2 - Square\n";
    std::cout << "\n";
    std::cout << " - - - -\n";
    std::cout << "|       |\n";
    std::cout << "|       |\n";
    std::cout << "|       |\n";
    std::cout << " - - - -\n";

    // Task 3 - "ANKETA"

    std::cout << "\n";
    std::cout << "Task 3 - ANKETA\n";
    std::cout << "\n";
    setlocale(LC_CTYPE, "rus");
    std::cout << " Фамилия : Гейтс\n";
    std::cout << " Имя : Билл\n";
    std::cout << " Отчество : Иванович\n";
    std::cout << " Пол : мужской\n";
    std::cout << " Дата рождения : 1.01.1900\n";
    std::cout << " Адрес : One Microsoft Way, 1, NY, USA\n";
    std::cout << " Номер телефон : 1-2-3-4-5\n";
    std::cout << " Место учебы : - \n";
    std::cout << " Класс : - \n";
    std::cout << " Хобби : программирование\n";
}


// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
